EXERCISE
-------------------------------------------------------------

1. Write a SQL statement to create the employees table with the columns:

emp_id (integer, primary key)

name (text, not null)

department (text, not null)

salary (integer)

city (text)


CREATE TABLE Employees (
  emp_id INT PRIMARY KEY,
  name VARCHAR(50) NOT NULL,
  department VARCHAR(50) NOT NULL,
  salary INT,
  city VARCHAR(50)
);


2. Write INSERT statements to add at least 5 employees into the employees table with different departments, salaries, and cities.

INSERT INTO Employees (emp_id,name, department, salary, city)
VALUES
	(1, 'Rania','Sales and Marketing', 58000, 'Petaling Jaya'),
    (2, 'Aishah','Finance', 40000, 'Cyberjaya'),
    (3, 'Aydan','Food and Beverage', 40000, 'Nilai'),
    (4, 'Shafiqah', 'IT Services', 82000, 'Sepang'),
    (5, 'Atiqah', 'Education', 35000, 'Sepang'),
    (6, 'Ain', 'Finance', 50000, 'Sepang'),
    (7, 'Khairul', 'Engineering', 52000, 'Petaling Jaya'),
    (8, 'Shah', 'Engineering', 62000, 'Sepang');


3. Write a query to show all columns for all employees in the table.

SELECT * FROM Employees


4. Write a query to show only the name and salary of all employees.

SELECT name, salary FROM Employees


5. Write a query to show all employees who work in the Engineering department.

SELECT * FROM Employees
WHERE department IN ('Engineering');


6. Write a query to show all employees whose salary is greater than 50,000.

SELECT * FROM Employees
WHERE salary > 50000;


7. Write a query to show all employees who live in the city Mumbai.

SELECT * FROM Employees
WHERE city IN ('Mumbai');


8. Write a query to list all employees ordered by salary from highest to lowest.

SELECT * FROM Employees
ORDER BY salary DESC;


9. Write a query to list all employees ordered by name in Aâ€“Z order.

SELECT * FROM Employees
ORDER BY name ASC;


10. Write a query to show the name, salary, and a calculated column called monthly_salary which is salary / 12.

SELECT name, salary, salary/12 AS monthly_salary
FROM Employees


11. Write an ALTER TABLE statement to add a new column called monthly_salary to the employees table.

ALTER TABLE Employees
ADD monthly_salary INT


12. Write an UPDATE statement to fill the monthly_salary column for all employees so that monthly_salary = salary / 12.

UPDATE Employees
SET monthly_salary = salary / 12;


13. Add another calculated column, salary_next_year, such that the current salary has been increased by 9%.

Salary + 0.09 * Salary = salary_next_year

ALTER TABLE Employees
ADD salary_next_year INT

UPDATE Employees
SET salary_next_year = salary + 0.09 * salary;